astb_relise/src/Documents/ОбращениеНаСклад/ОбращениеНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеНаСклад</name>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОбращения</name>
    <type>
      <types>CatalogRef.КатегорииОбращенияНаСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбращения</name>
    <type>
      <types>EnumRef.СтатусыОбращенийНаСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПолучения</name>
    <type>
      <types>CatalogRef.МестаПолучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныНевыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/СогласияНаИнформирование/СогласияНаИнформирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СогласияНаИнформирование</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>SMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Email</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыУведомлений/ВидыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомлений</name>
  <enumValues>
    <name>ВозвратИзЧистки</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОбращения</name>
  </enumValues>
  <enumValues>
    <name>Поздравление</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеСредствЗащиты</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>Произвольное</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/СообщениеSMS/СообщениеSMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеSMS</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ОбращениеНаСклад</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ПоступлениеНоменклатуры</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>DocumentRef.ВозвратИзЧистки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьВТранслите</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСообщениеSMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КакСвязаться</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСообщения</name>
      <type>
        <types>EnumRef.СостоянияСообщенияSMS</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ОбращениеНаСклад/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	ОтправитьУведомление = Ложь;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.Страницы.ПодчиненныеЭлементы.ГруппаПолучение.Видимость = (Объект.КатегорияОбращения = Справочники.КатегорииОбращенияНаСклад.ЗаявкаНаПолучение);
	Элементы.МестоПолучения.Видимость = (Объект.КатегорияОбращения = Справочники.КатегорииОбращенияНаСклад.ЗаявкаНаПолучение);
	Элементы.ОтправитьSMS.Видимость = МожноОтправитьSMS();
	
КонецПроцедуры	

&НаСервере
Функция МожноОтправитьSMS()
	
	Если НЕ Объект.Проведен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СогласияНаИнформированиеСрезПоследних.Организация КАК Организация,
	|	СогласияНаИнформированиеСрезПоследних.Сотрудник КАК Сотрудник,
	|	СогласияНаИнформированиеСрезПоследних.SMS КАК SMS,
	|	СогласияНаИнформированиеСрезПоследних.Email КАК Email
	|ИЗ
	|	РегистрСведений.СогласияНаИнформирование.СрезПоследних(
	|			&ДатаАнализа,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК СогласияНаИнформированиеСрезПоследних
	|ГДЕ
	|	СогласияНаИнформированиеСрезПоследних.SMS";
	
	Запрос.УстановитьПараметр("ДатаАнализа",ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Объект.Ссылка));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Сотрудник",	Объект.Сотрудник);
	
	Результат = Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(Объект.СодержаниеОтвета) И НЕ Результат.Пустой() И НЕ Модифицированность Тогда
		УстановитьЗаголовокКнопкиОтправкиSMS();
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокКнопкиОтправкиSMS()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщениеSMS.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СообщениеSMS КАК СообщениеSMS
	|ГДЕ
	|	СообщениеSMS.ВзаимодействиеОснование = &ВзаимодействиеОснование";
	
	Запрос.УстановитьПараметр("ВзаимодействиеОснование",Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Элементы.ОтправитьSMS.Заголовок = "Отправить SMS повторно";
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВА"

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкуУведомленияОбОбработкеОбращений(ВнешнийПользователь)
	
	Если ЗначениеЗаполнено(ВнешнийПользователь.ОбъектАвторизации) Тогда
		
		Возврат ВнешнийПользователь.ОбъектАвторизации.УведомлятьОбОбработкеОбращений;
		
	Иначе
		
	    Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ДатаОтветаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СоздательДокумента) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		
		ОтправитьУведомление = (ПолучитьНастройкуУведомленияОбОбработкеОбращений(Объект.СоздательДокумента) И ОтправкаPUSHВызовСервера.МожноОтправлятьУведомления(Объект.СоздательДокумента));
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбращенияПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СоздательДокумента) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		
		ОтправитьУведомление = (ПолучитьНастройкуУведомленияОбОбработкеОбращений(Объект.СоздательДокумента) И ОтправкаPUSHВызовСервера.МожноОтправлятьУведомления(Объект.СоздательДокумента));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеОтветаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СоздательДокумента) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		
		ОтправитьУведомление = (ПолучитьНастройкуУведомленияОбОбработкеОбращений(Объект.СоздательДокумента) И ОтправкаPUSHВызовСервера.МожноОтправлятьУведомления(Объект.СоздательДокумента));
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОтправитьУведомление Тогда
		
		Уведомление = Новый ДоставляемоеУведомление;
		Уведомление.Данные = "ОбратнаяСвязь";
		Уведомление.Текст = "Обработано Ваше обращение №" + Объект.Номер + " от " + Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
		ОтправкаPUSHВызовСервера.ОтправитьУведомление(Уведомление,Объект.СоздательДокумента.ОбъектАвторизации, Перечисления.ВидыУведомлений.ОбработкаОбращения);
		
	КонецЕсли;	
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Документы.ОбращениеНаСклад.ЗаполнитьТаблицуДокумента(ТекущийОбъект);
	
	ЗаполнитьСодержаниеОбращенияНаСервере(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
	Модифицированность = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСодержаниеОбращенияНаСервере(ТекущийОбъект)
	
	ТекущийОбъект.СодержаниеОбращения = "";	
	
	Сч = 1;
	
	Для Каждого СтрокаТаблицы Из ТекущийОбъект.Товары Цикл
		
		Если СтрокаТаблицы.Отказ Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			
			ТекущаяНоменклатура = СтрокаТаблицы.Номенклатура.Наименование;
			
		Иначе
			
			ТекущаяНоменклатура = "<Номенклатура не выбрана>";
			
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.СодержаниеОбращения) Тогда
			
			ТекущийОбъект.СодержаниеОбращения = Строка(Сч) + ". " + ТекущаяНоменклатура + ?(ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатуры)," (" + СтрокаТаблицы.ХарактеристикаНоменклатуры.Наименование + ")","") + " количество: " + СтрокаТаблицы.Количество;
			
		Иначе
			
			ТекущийОбъект.СодержаниеОбращения = ТекущийОбъект.СодержаниеОбращения + Символы.ПС + Строка(Сч) + ". " + ТекущаяНоменклатура + ?(ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатуры)," (" + СтрокаТаблицы.ХарактеристикаНоменклатуры.Наименование + ")","") + " количество: " + СтрокаТаблицы.Количество;
			
		КонецЕсли;
		
		Сч = Сч + 1; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	
	ЗаполнитьТоварыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияОбращенияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();
	
	Если НЕ Объект.КатегорияОбращения = ПредопределенноеЗначение("Справочник.КатегорииОбращенияНаСклад.ЗаявкаНаПолучение") И НЕ Объект.Товары.Количество() = 0 Тогда
		
	    Объект.Товары.Очистить();
		Объект.СодержаниеОтвета = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Не Объект.Товары.Количество() = 0 ТОгда
		
		Объект.Товары.Очистить();
	    Объект.СодержаниеОтвета = "";
		
	КонецЕсли;	
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если Не Объект.Товары.Количество() = 0 ТОгда
		
		Объект.Товары.Очистить();
	    Объект.СодержаниеОтвета = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если Не Объект.Товары.Количество() = 0 ТОгда
		
		Объект.Товары.Очистить();
	    Объект.СодержаниеОтвета = "";
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТоварыНормаВыдачи" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.НормаВыдачи) Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.НормаВыдачи);
			ОткрытьФорму("Справочник.НормыВыдачиСИЗ.Форма.ФормаЭлемента", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатура" Тогда
		
		ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыНоменклатура.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокНоменклатурыВыдачи(ТекущиеДанные.НоменклатураНормы,Объект.Сотрудник));
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатураНормы" Тогда	
		
		//список нужен, если используются группы "ИЛИ"
		Если ПолучитьОпциюОрганизации(Объект.Организация,"ИспользоватьГруппыИЛИ") Тогда
			ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыНоменклатураНормы.СписокВыбора.ЗагрузитьЗначения(ПроцедурыРаботыСНормамиСервер.ПолучитьСписокНоменклатурыНормыПоНормеВыдачи(ТекущиеДанные.НормаВыдачи));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНоменклатурыВыдачи(НоменклатураНормы,Сотрудник)
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Сотрудник);
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Объект.Ссылка);
	
	ТаблицаЗанятыхРМ 			= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуЗанятыхРабочихМестСУсловиями(МассивСотрудников,Объект.Организация,ДатаАнализа);
	ТаблицаУстановленныхНорм 	= ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуУстановленныхНорм(Объект.Организация,ДатаАнализа,ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Подразделение"),ТаблицаЗанятыхРМ.ВыгрузитьКолонку("Должность"));
	ТаблицаСНормами 			= ПроцедурыРаботыСНормамиСервер.ПодобратьНормы(ТаблицаЗанятыхРМ,ТаблицаУстановленныхНорм.Скопировать(НОВЫЙ Структура("НоменклатураНормы",НоменклатураНормы)),Объект.Организация,ДатаАнализа,"Сотрудник,Подразделение,Должность,НоменклатураНормы,Использовать");
	
	ТаблицаСоответствия = ПроцедурыРаботыСНормамиСервер.ПолучитьСоответствияНоменклатурыДляСотрудника(ТаблицаСНормами,?(ЗначениеЗаполнено(Объект.Ссылка),ДатаАнализа,ТекущаяДата()),НоменклатураНормы);
	
	Возврат ТаблицаСоответствия.ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОпциюОрганизации(Организация,НаименованиеОпции)
	
	Возврат Организация[НаименованиеОпции];
	
КонецФункции

&НаСервере
Процедура ТоварыПриИзмененииНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ЗаполнитьСодержаниеОбращенияНаСервере(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ТоварыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтказПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные.Отказ Тогда
		ТекущиеДанные.Номенклатура 					= ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ТекущиеДанные.ХарактеристикаНоменклатуры 	= ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	Иначе
		ТекущиеДанные.ПричинаОтказа = ПредопределенноеЗначение("Справочник.ПричиныНевыдачиСИЗ.ПустаяСсылка");
	КонецЕсли;     	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьSMSНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Объект.Сотрудник);
	
	МассивАдресатов = Справочники.Сотрудники.ПолучитьМассивАдресатовSMS(МассивСотрудников);
	
	Если МассивАдресатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	 
	
	НовоеСообщениеSMS 							= Документы.СообщениеSMS.СоздатьДокумент();
	НовоеСообщениеSMS.ТекстСообщения 			= Объект.СодержаниеОтвета;
	НовоеСообщениеSMS.ВзаимодействиеОснование 	= Объект.Ссылка;
	НовоеСообщениеSMS.Важность 					= Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	НовоеСообщениеSMS.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	НовоеСообщениеSMS.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	НовоеСообщениеSMS.Дата 						= ТекущаяДата();
	
	Для Каждого ЭлементМассива Из МассивАдресатов Цикл
		
		НоваяСтрока 						= НовоеСообщениеSMS.Адресаты.Добавить();
		НоваяСтрока.КакСвязаться          	= ЭлементМассива.Телефон;
		НоваяСтрока.НомерДляОтправки        = ЭлементМассива.НомерДляОтправки;
		НоваяСтрока.ПредставлениеКонтакта 	= ЭлементМассива.Представление;
		НоваяСтрока.Контакт               	= ЭлементМассива.ИсточникКонтактнойИнформации;
		
	КонецЦикла;
	
	ВзаимодействияКлиентСервер.УстановитьСостояниеИсходящееДокументСообщениеSMS(НовоеСообщениеSMS);
	
	НовоеСообщениеSMS.УстановитьНовыйНомер();
	НовоеСообщениеSMS.Записать(РежимЗаписиДокумента.Запись);
	
	УстановитьЗаголовокКнопкиОтправкиSMS();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMS(Команда)
	
	ОтправитьSMSНаСервере();
	
КонецПроцедуры
